#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
Тогда открылось окно "Обслуживание клиентов"
И в таблице 'Список' я перехожу к строке:
	| "Дата"                | "Клиент"         | "Номер"     | "Статус заявки"              |
	| "01.10.2025 12:00:00" | "Офис на этажах" | "000000012" | "Ожидается выполнения работ" |
И в таблице 'Список' я активизирую поле с именем 'Клиент'
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *"
И я перехожу к закладке с именем 'ГруппаВыполненныеРаботы'
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И я перехожу к закладке с именем 'ГруппаОсновное'
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И я перехожу к закладке с именем 'ГруппаВыполненныеРаботы'
И в таблице 'ВКМ_ВыполненныеРаботы' я выбираю текущую строку
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВКМ_ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"
И в таблице 'Список' я перехожу на один уровень вниз
И в таблице 'Список' я перехожу на один уровень вниз
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"     |
	| "000000011" | "Настрока сервера" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от * *"
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов'
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "4,50"
И я перехожу к следующему реквизиту
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "4,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВКМ_ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"       |
	| "000000012" | "Обновление сервера" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от * *"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов'
И в таблице 'ВКМ_ВыполненныеРаботы' я выбираю текущую строку
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "4,00"
И я перехожу к следующему реквизиту
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "4,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И я перехожу к закладке с именем 'ГруппаОсновное'
И из выпадающего списка с именем 'СтатусЗаявки' я выбираю точное значение "Заявка заполнена"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
Тогда открылось окно "Обслуживание клиентов"
И в таблице 'Список' я перехожу к строке:
	| "Дата"                | "Клиент"           | "Номер"     | "Статус заявки"              |
	| "20.10.2025 12:00:00" | "Интернет для нас" | "000000011" | "Ожидается выполнения работ" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от *"
И я перехожу к закладке с именем 'ГруппаВыполненныеРаботы'
И я перехожу к закладке с именем 'ГруппаОсновное'
И я перехожу к закладке с именем 'ГруппаВыполненныеРаботы'
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВКМ_ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"            |
	| "000000008" | "Подключение компьютеров" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от * *"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И в таблице 'ВКМ_ВыполненныеРаботы' я активизирую поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов'
И в таблице 'ВКМ_ВыполненныеРаботы' я выбираю текущую строку
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "3,00"
И я перехожу к следующему реквизиту
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "3,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВКМ_ВыполненныеРаботыДобавить'
И в таблице 'ВКМ_ВыполненныеРаботы' я нажимаю кнопку выбора у реквизита с именем 'ВКМ_ВыполненныеРаботыОписаниеРабот'
Тогда открылось окно "Номенклатура"
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"              |
	| "000000007" | "Обслуживание МФУ/сканеров" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента * от * *"
И я перехожу к следующему реквизиту
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыФактическиПотраченоЧасов' я ввожу текст "3,00"
И я перехожу к следующему реквизиту
И в таблице 'ВКМ_ВыполненныеРаботы' в поле с именем 'ВКМ_ВыполненныеРаботыЧасыКОплатеКлиенту' я ввожу текст "3,00"
И в таблице 'ВКМ_ВыполненныеРаботы' я завершаю редактирование строки
И я перехожу к закладке с именем 'ГруппаОсновное'
И из выпадающего списка с именем 'СтатусЗаявки' я выбираю точное значение "Заявка заполнена"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента * от * *" в течение 20 секунд
