#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
Тогда открылось окно "Обслуживание клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'Дата'
И в поле с именем 'Дата' я ввожу текст "01.10.2025  0:00:00"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Клиент'
Тогда открылось окно "Контрагенты"
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"   |
	| "000000007" | "Офис на этажах" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Договор'
Тогда открылось окно "Договоры контрагентов"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_ДатаПроведенияРабот'
И в поле с именем 'ВКМ_ДатаПроведенияРабот' я ввожу текст "03.11.2025"
И в поле с именем 'ВКМ_ВремяНачалаРабот' я ввожу текст "10:00:00"
И я перехожу к следующему реквизиту
И в поле с именем 'ВКМ_ВремяОкончанияРабот' я ввожу текст "19:00:00"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Специалист'
Тогда открылось окно "Сотрудники"
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"            |
	| "000000001" | "Петров Николай Иванович" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И из выпадающего списка с именем 'СтатусЗаявки' я выбираю точное значение "Ожидается выполнения работ"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента (создание) *" в течение 20 секунд
Тогда открылось окно "Обслуживание клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'Дата'
И в поле с именем 'Дата' я ввожу текст "20.09.2025  0:00:00"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Клиент'
Тогда открылось окно "Контрагенты"
И в таблице 'Список' я выбираю текущую строку
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"     |
	| "000000008" | "Интернет для нас" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Договор'
Тогда открылось окно "Договоры контрагентов"
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_ДатаПроведенияРабот'
И в поле с именем 'ВКМ_ДатаПроведенияРабот' я ввожу текст "21.10.2025"
И в поле с именем 'ВКМ_ВремяНачалаРабот' я ввожу текст "11:00:00"
И я перехожу к следующему реквизиту
И в поле с именем 'ВКМ_ВремяОкончанияРабот' я ввожу текст "15:00:00"
И я нажимаю кнопку выбора у поля с именем 'ВКМ_Специалист'
Тогда открылось окно "Сотрудники"
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"              |
	| "000000003" | "Малышев Дмитрий Викторови" |
И в таблице 'Список' я выбираю текущую строку
Тогда открылось окно "Обслуживание клиента (создание) *"
И из выпадающего списка с именем 'СтатусЗаявки' я выбираю точное значение "Ожидается выполнения работ"
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна "Обслуживание клиента (создание) *" в течение 20 секунд
